Revit 2027 API
Face.Evaluate Method
Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Evaluate(
	UV params
)
Public Function Evaluate (
	params As UV
) As XYZ
public:
XYZ^ Evaluate(
	UV^ params
)
member Evaluate :
        params : UV -> XYZ
Parameters
params UV
The parameters to be evaluated, in natural parameterization of the face.
Return Value
XYZ
The XYZ coordinates.
Remarks
The evaluation is performed on the underlying Surface, and can return results outside of the boundaries of the face.
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace